<?php

return array (

    /*
    |--------------------------------------------------------------------------
    | superuser
    |--------------------------------------------------------------------------
    |
    | Any user with superuser permissions automatically has access to everything,
    | regardless of the user permissions and group permissions.
    |
    */

    'superuser' => 'полный доступ к админ. панели и всем елементам',

    /*
    |--------------------------------------------------------------------------
    | administrator
    |--------------------------------------------------------------------------
    |
    | Разрешает доступ в админку
    |
    */

    'administrator' => 'доступ в админ. панель',

    /*
    |--------------------------------------------------------------------------
    | menu
    |------------------------------------------------------------------------
    */

    'page_create' => 'разрешение создавать страницы',
    'page_read'   => 'разрешение просмотра страниц',
    'page_write'  => 'разрешение редактирования страниц',
    'page_delete' => 'разрешение удаления страниц',

    'tag_create' => 'разрешение создавать теги',
    'tag_read'   => 'разрешение просмотра тегов',
    'tag_write'  => 'разрешение редактирования тегов',
    'tag_delete' => 'разрешение удаления тегов',

    'news_create' => 'разрешение создавать новости',
    'news_read'   => 'разрешение просмотра новостей',
    'news_write'  => 'разрешение редактирования новостей',
    'news_delete' => 'разрешение удаления новостей',

    'question_create' => 'разрешение создавать вопросы',
    'question_read'   => 'разрешение просмотра вопросов',
    'question_write'  => 'разрешение редактирования вопросов',
    'question_delete' => 'разрешение удаления вопросов',

    'menu_create' => 'разрешение создавать меню',
    'menu_read'   => 'разрешение просмотра меню',
    'menu_write'  => 'разрешение редактирования меню',
    'menu_delete' => 'разрешение удаления меню',

    'banner_create' => 'разрешение создавать банеры',
    'banner_read'   => 'разрешение просмотра банеров',
    'banner_write'  => 'разрешение редактирования банеров',
    'banner_delete' => 'разрешение удаления банеров',

    'textwidget_create' => 'разрешение создавать текстовые виджеты',
    'textwidget_read'   => 'разрешение просмотра текстовых виджетов',
    'textwidget_write'  => 'разрешение редактирования текстовых виджетов',
    'textwidget_delete' => 'разрешение удаления текстовых виджетов',

    'variablevalue_read'  => 'разрешение просмотра значений переменных',
    'variablevalue_write' => 'разрешение изменять значения переменных',
    'variable_create'     => 'разрешение создавать переменные',
    'variable_read'       => 'разрешение просмотра переменных',
    'variable_write'      => 'разрешение редактирования переменных',
    'variable_delete'     => 'разрешение удаления переменных',

    'comment_create' => 'разрешение создавать комментарии',
    'comment_read'   => 'разрешение просмотра комментариев',
    'comment_write'  => 'разрешение редактирования комментариев',
    'comment_delete' => 'разрешение удаления комментариев',

    'supplier_create' => 'разрешение создавать поставщиков',
    'supplier_read'   => 'разрешение просмотра поставщиков',
    'supplier_write'  => 'разрешение редактирования поставщиков',
    'supplier_delete' => 'разрешение удаления поставщиков',

    'category_create' => 'разрешение создавать категории',
    'category_read'   => 'разрешение просмотра категорий',
    'category_write'  => 'разрешение редактирования категорий',
    'category_delete' => 'разрешение удаления категорий',

    'unit_create' => 'разрешение создавать единицы измерения',
    'unit_read'   => 'разрешение просмотра единиц измерения',
    'unit_write'  => 'разрешение редактирования единиц измерения',
    'unit_delete' => 'разрешение удаления единиц измерения',

    'parameter_create' => 'разрешение создавать дополнительные параметры',
    'parameter_read'   => 'разрешение просмотра дополнительных параметров',
    'parameter_write'  => 'разрешение редактирования дополнительных параметров',
    'parameter_delete' => 'разрешение удаления дополнительных параметров',

    'nutritionalvalue_create' => 'разрешение создавать единицы пищевой ценности',
    'nutritionalvalue_read'   => 'разрешение просмотра единиц пищевой ценности',
    'nutritionalvalue_write'  => 'разрешение редактирования единиц пищевой ценности',
    'nutritionalvalue_delete' => 'разрешение удаления единиц пищевой ценности',

    'translation_create' => 'разрешение просмотра переводов',
    'translation_write'  => 'разрешение редактирования переводов',

    'user_create'      => 'разрешение создавать пользователей',
    'user_read'        => 'разрешение просмотра пользователей',
    'user_write'       => 'разрешение редактирования пользователей',
    'user_delete'      => 'разрешение удаления пользователей',
    'user_group_write' => 'разрешение редактирования груп пользователя',

    'group_create' => 'разрешение создавать групи',
    'group_read'   => 'разрешение просмотра груп',
    'group_write'  => 'разрешение редактирования груп',
    'group_delete' => 'разрешение удаления груп',
);