<?php

return array (

    /*
    |--------------------------------------------------------------------------
    | superuser
    |--------------------------------------------------------------------------
    |
    | Any user with superuser permissions automatically has access to everything,
    | regardless of the user permissions and group permissions.
    |
    */

    'superuser' => 'полный доступ к админ. панели и всем елементам',

    /*
    |--------------------------------------------------------------------------
    | administrator
    |--------------------------------------------------------------------------
    |
    | Разрешает доступ в админку
    |
    */

    'administrator' => 'доступ в админ. панель',

    /*
    |--------------------------------------------------------------------------
    | menu
    |------------------------------------------------------------------------
    */

    'page_create' => 'разрешение создавать страницы',
    'page_read' => 'разрешение просмотра страниц',
    'page_write' => 'разрешение редактирования страниц',
    'page_delete' => 'разрешение удаления страниц',

    'tag_create' => 'разрешение создавать теги',
    'tag_read' => 'разрешение просмотра тегов',
    'tag_write' => 'разрешение редактирования тегов',
    'tag_delete' => 'разрешение удаления тегов',

    'news_create' => 'разрешение создавать новости',
    'news_read' => 'разрешение просмотра новостей',
    'news_write' => 'разрешение редактирования новостей',
    'news_delete' => 'разрешение удаления новостей',

    'question_create' => 'разрешение создавать вопросы',
    'question_read' => 'разрешение просмотра вопросов',
    'question_write' => 'разрешение редактирования вопросов',
    'question_delete' => 'разрешение удаления вопросов',

    'menu_create' => 'разрешение создавать меню',
    'menu_read' => 'разрешение просмотра меню',
    'menu_write' => 'разрешение редактирования меню',
    'menu_delete' => 'разрешение удаления меню',

    'banner_create' => 'разрешение создавать банеры',
    'banner_read' => 'разрешение просмотра банеров',
    'banner_write' => 'разрешение редактирования банеров',
    'banner_delete' => 'разрешение удаления банеров',

    'textwidget_create' => 'разрешение создавать текстовые виджеты',
    'textwidget_read' => 'разрешение просмотра текстовых виджетов',
    'textwidget_write' => 'разрешение редактирования текстовых виджетов',
    'textwidget_delete' => 'разрешение удаления текстовых виджетов',

    'variablevalue_read' => 'разрешение просмотра значений переменных',
    'variablevalue_write' => 'разрешение изменять значения переменных',
    'variable_create' => 'разрешение создавать переменные',
    'variable_read' => 'разрешение просмотра переменных',
    'variable_write' => 'разрешение редактирования переменных',
    'variable_delete' => 'разрешение удаления переменных',

    'translation_create' => 'разрешение просмотра переводов',
    'translation_write' => 'разрешение редактирования переводов',

    'user_create' => 'разрешение создавать пользователей',
    'user_read' => 'разрешение просмотра пользователей',
    'user_write' => 'разрешение редактирования пользователей',
    'user_delete' => 'разрешение удаления пользователей',
    'user_group_write' => 'разрешение редактирования груп пользователя',

    'group_create'  => 'разрешение создавать групи',
    'group_read'  => 'разрешение просмотра груп',
    'group_write'  => 'разрешение редактирования груп',
    'group_delete'  => 'разрешение удаления груп',
);