<?php

return array(
  'subscribe_period_label' => '{0} без подписки|{1} раз в неделю|{2} раз в две недели',
  'count_of_dinners' => '{0} ужинов|{1} ужин|[2,4] ужина|[5,Inf] ужинов',
  'count_of_portions' => '{0} порций|{1} порция|[2,4] порции|[5,Inf] порций',
  'count_of_recipes' => '{0} рецептов|{1} рецепт|[2,4] рецепта|[5,Inf] рецептов',
  'count_of_news' => '{0} новостей|{1} новость|[2,4] новости|[5,Inf] новостей',
  'count_of_articles' => '{0} статтей|{1} статью|[2,4] статьи|[5,Inf] статтей',
  'pagination_next' => 'следующие',
  'day_of_week_to_string_when' => '{0} воскресенья|{1} понедельника|{2} вторника|{3} среди|{4} четверга|{5} пятницы|{6} субботы',
  'day_with_number' => '{1} День I|{2} День II|{3} День III|{4} День IV|{5} День V|{6} День VI|{7} День VII',
);