<?php

return array (
  'home top text 1' => 'Сервис доставки качественных продуктов на дом',
  'home top text 2' => 'просто и вкусно',
  'registration coupon description' => 'Купон на скидку при регистрации',
  'registration_coupon_description' => 'Купон на скидку при регистрации',
  'video on home title' => 'Основатель о том, как работает сервис',
  'delivery text title' => 'доставка бесплатно',
  'delivery text subtitle' => 'c воскресенья по понедельник, и до 12 км от МКАД',
  'delivery text description' => 'Доставка на большие расстояния стоит 24 рубля за каждый километр от МКАД',
  'home nutritionist text' => 'Просчитав детально меню на следующую неделю (состав и калорийность блюд), я могу подтвердить, что блюда сбалансированы по белкам, жирам и углеводам, низкокалорийные, содержат необходимые нашему организму витамины и минералы. И самое главное — вкусные и разнообразные! Просчитав детально меню на следующую неделю (состав и калорийность блюд), я могу подтвердить, что блюда сбалансированы по белкам, жирам и углеводам, низкокалорийные, содержат необходимые нашему организму витамины и минералы. И самое главное — вкусные и разнообразные! Просчитав детально меню на следующую неделю (состав и калорийность блюд), я могу подтвердить, что блюда сбалансированы по белкам, жирам и углеводам, низкокалорийные, содержат необходимые нашему организму витамины и минералы. И самое главное — вкусные и разнообразные!',
  'nutritionist name' => 'Людмила Денисенко',
  'nutritionist description' => '(диетолог, «Азбука стройности»)',
  'subscribe widget title' => 'будьте в курсе',
  'subscribe widget description' => 'Получать раз в неделю информацию о специальных предложениях, акциях и изменениях меню',
  'subscribe widget title for recipe page' => 'Понравился рецепт?',
  'subscribe widget description for recipe page' => 'Подпишитесь на нашу рассылку и мы будем присылать вам по 3 интересных блюда каждую неделю',
  'promo code description on order page' => 'Промокод можно получить в купонных сертификатах следите за акциями на нашем сайте',
  'comment helper text on order page' => 'Дополнительно сообщите о наличии консьержа или домофона, а также номер поъезда и особенности ориентирования на местности',
  'basket description on order page' => 'На приготовление одного блюда понадобится не более 40 минут',
  'login info text for old users' => 'Если вы были пользователем предыдущей версии сайта и пришли сюда впервые — воспользуйтесь восстановлением пароля.<br>Вход на сайт теперь осуществляется через емейл',
);
